{"config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["bit_0", 0, 0], ["bit_1", 0, 0], ["bit_2", 0, 0], ["bit_3", 0, 0], ["bit_4", 0, 0], ["bit_5", 0, 0], ["bit_6", 0, 0], ["bit_7", 0, 0], ["bit_8", 0, 0], ["bit_9", 0, 0], ["bit_10", 0, 0], ["bit_11", 0, 0], ["z_rot_sin", 0, 0], ["z_rot_cos", 0, 0], ["y_rot", 0, 0], ["x_rot", 0, 0], ["center_x", 0, 0], ["center_y", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 1, 64, 64], "input_dtype": "float32"}}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_1", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_1", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["elu_1", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_1", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 16, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_2", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_2", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["elu_2", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_2", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 16, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_3", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_3", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["elu_3", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_3", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 16, "bias": true, "activation": "linear"}}, {"name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["convolution2d_1", 0, 0], ["convolution2d_3", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_1", "concat_axis": -1}}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_4", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_4", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["elu_4", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 16, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_5", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_5", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["elu_5", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 16, "bias": true, "activation": "linear"}}, {"name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["merge_1", 0, 0], ["convolution2d_5", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_2", "concat_axis": -1}}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_6", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_6", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["elu_6", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_6", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 16, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_7", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_7", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["elu_7", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_7", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 16, "bias": true, "activation": "linear"}}, {"name": "merge_3", "class_name": "Merge", "inbound_nodes": [[["merge_2", 0, 0], ["convolution2d_7", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_3", "concat_axis": -1}}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_3", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_8", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_8", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["elu_8", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_8", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_9", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_9", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"name": "convolution2d_9", "class_name": "Convolution2D", "inbound_nodes": [[["elu_9", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_9", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_10", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_10", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "config": {"trainable": true, "name": "elu_10", "alpha": 1.0}}, {"name": "convolution2d_10", "class_name": "Convolution2D", "inbound_nodes": [[["elu_10", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_10", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "merge_4", "class_name": "Merge", "inbound_nodes": [[["convolution2d_8", 0, 0], ["convolution2d_10", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_4", "concat_axis": -1}}, {"name": "batchnormalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_4", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_11", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_11", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_11", 0, 0]]], "config": {"trainable": true, "name": "elu_11", "alpha": 1.0}}, {"name": "convolution2d_11", "class_name": "Convolution2D", "inbound_nodes": [[["elu_11", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_11", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_12", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_12", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_12", 0, 0]]], "config": {"trainable": true, "name": "elu_12", "alpha": 1.0}}, {"name": "convolution2d_12", "class_name": "Convolution2D", "inbound_nodes": [[["elu_12", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_12", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "merge_5", "class_name": "Merge", "inbound_nodes": [[["merge_4", 0, 0], ["convolution2d_12", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_5", "concat_axis": -1}}, {"name": "batchnormalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_5", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_13", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_13", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_13", 0, 0]]], "config": {"trainable": true, "name": "elu_13", "alpha": 1.0}}, {"name": "convolution2d_13", "class_name": "Convolution2D", "inbound_nodes": [[["elu_13", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_13", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_13", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_14", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_14", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_14", 0, 0]]], "config": {"trainable": true, "name": "elu_14", "alpha": 1.0}}, {"name": "convolution2d_14", "class_name": "Convolution2D", "inbound_nodes": [[["elu_14", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_14", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "merge_6", "class_name": "Merge", "inbound_nodes": [[["merge_5", 0, 0], ["convolution2d_14", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_6", "concat_axis": -1}}, {"name": "batchnormalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_6", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_15", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_15", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_15", 0, 0]]], "config": {"trainable": true, "name": "elu_15", "alpha": 1.0}}, {"name": "convolution2d_15", "class_name": "Convolution2D", "inbound_nodes": [[["elu_15", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_15", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_15", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_16", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_16", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_16", 0, 0]]], "config": {"trainable": true, "name": "elu_16", "alpha": 1.0}}, {"name": "convolution2d_16", "class_name": "Convolution2D", "inbound_nodes": [[["elu_16", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_16", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 32, "bias": true, "activation": "linear"}}, {"name": "merge_7", "class_name": "Merge", "inbound_nodes": [[["merge_6", 0, 0], ["convolution2d_16", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_7", "concat_axis": -1}}, {"name": "batchnormalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_7", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_17", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_17", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "config": {"trainable": true, "name": "elu_17", "alpha": 1.0}}, {"name": "convolution2d_17", "class_name": "Convolution2D", "inbound_nodes": [[["elu_17", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_17", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_17", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_18", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_18", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_18", 0, 0]]], "config": {"trainable": true, "name": "elu_18", "alpha": 1.0}}, {"name": "convolution2d_18", "class_name": "Convolution2D", "inbound_nodes": [[["elu_18", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_18", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_18", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_19", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_19", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_19", 0, 0]]], "config": {"trainable": true, "name": "elu_19", "alpha": 1.0}}, {"name": "convolution2d_19", "class_name": "Convolution2D", "inbound_nodes": [[["elu_19", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_19", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "merge_8", "class_name": "Merge", "inbound_nodes": [[["convolution2d_17", 0, 0], ["convolution2d_19", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_8", "concat_axis": -1}}, {"name": "batchnormalization_20", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_8", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_20", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_20", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_20", 0, 0]]], "config": {"trainable": true, "name": "elu_20", "alpha": 1.0}}, {"name": "convolution2d_20", "class_name": "Convolution2D", "inbound_nodes": [[["elu_20", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_20", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_21", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_20", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_21", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_21", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "config": {"trainable": true, "name": "elu_21", "alpha": 1.0}}, {"name": "convolution2d_21", "class_name": "Convolution2D", "inbound_nodes": [[["elu_21", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_21", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "merge_9", "class_name": "Merge", "inbound_nodes": [[["merge_8", 0, 0], ["convolution2d_21", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_9", "concat_axis": -1}}, {"name": "batchnormalization_22", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_9", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_22", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_22", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_22", 0, 0]]], "config": {"trainable": true, "name": "elu_22", "alpha": 1.0}}, {"name": "convolution2d_22", "class_name": "Convolution2D", "inbound_nodes": [[["elu_22", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_22", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_23", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_22", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_23", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_23", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "config": {"trainable": true, "name": "elu_23", "alpha": 1.0}}, {"name": "convolution2d_23", "class_name": "Convolution2D", "inbound_nodes": [[["elu_23", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_23", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "merge_10", "class_name": "Merge", "inbound_nodes": [[["merge_9", 0, 0], ["convolution2d_23", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_10", "concat_axis": -1}}, {"name": "batchnormalization_24", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_10", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_24", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_24", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_24", 0, 0]]], "config": {"trainable": true, "name": "elu_24", "alpha": 1.0}}, {"name": "convolution2d_24", "class_name": "Convolution2D", "inbound_nodes": [[["elu_24", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_24", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_25", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_24", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_25", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_25", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_25", 0, 0]]], "config": {"trainable": true, "name": "elu_25", "alpha": 1.0}}, {"name": "convolution2d_25", "class_name": "Convolution2D", "inbound_nodes": [[["elu_25", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_25", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "merge_11", "class_name": "Merge", "inbound_nodes": [[["merge_10", 0, 0], ["convolution2d_25", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_11", "concat_axis": -1}}, {"name": "batchnormalization_26", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_11", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_26", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_26", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_26", 0, 0]]], "config": {"trainable": true, "name": "elu_26", "alpha": 1.0}}, {"name": "convolution2d_26", "class_name": "Convolution2D", "inbound_nodes": [[["elu_26", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_26", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_27", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_26", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_27", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_27", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_27", 0, 0]]], "config": {"trainable": true, "name": "elu_27", "alpha": 1.0}}, {"name": "convolution2d_27", "class_name": "Convolution2D", "inbound_nodes": [[["elu_27", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_27", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "merge_12", "class_name": "Merge", "inbound_nodes": [[["merge_11", 0, 0], ["convolution2d_27", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_12", "concat_axis": -1}}, {"name": "batchnormalization_28", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_12", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_28", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_28", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_28", 0, 0]]], "config": {"trainable": true, "name": "elu_28", "alpha": 1.0}}, {"name": "convolution2d_28", "class_name": "Convolution2D", "inbound_nodes": [[["elu_28", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_28", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_29", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_28", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_29", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_29", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "config": {"trainable": true, "name": "elu_29", "alpha": 1.0}}, {"name": "convolution2d_29", "class_name": "Convolution2D", "inbound_nodes": [[["elu_29", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_29", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "bias": true, "activation": "linear"}}, {"name": "merge_13", "class_name": "Merge", "inbound_nodes": [[["merge_12", 0, 0], ["convolution2d_29", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_13", "concat_axis": -1}}, {"name": "batchnormalization_30", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_13", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_30", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_30", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_30", 0, 0]]], "config": {"trainable": true, "name": "elu_30", "alpha": 1.0}}, {"name": "convolution2d_30", "class_name": "Convolution2D", "inbound_nodes": [[["elu_30", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_30", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_31", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_30", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_31", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_31", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_31", 0, 0]]], "config": {"trainable": true, "name": "elu_31", "alpha": 1.0}}, {"name": "convolution2d_31", "class_name": "Convolution2D", "inbound_nodes": [[["elu_31", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_31", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_32", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_31", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_32", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_32", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_32", 0, 0]]], "config": {"trainable": true, "name": "elu_32", "alpha": 1.0}}, {"name": "convolution2d_32", "class_name": "Convolution2D", "inbound_nodes": [[["elu_32", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_32", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "bias": true, "activation": "linear"}}, {"name": "merge_14", "class_name": "Merge", "inbound_nodes": [[["convolution2d_30", 0, 0], ["convolution2d_32", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_14", "concat_axis": -1}}, {"name": "batchnormalization_33", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_14", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_33", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_33", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_33", 0, 0]]], "config": {"trainable": true, "name": "elu_33", "alpha": 1.0}}, {"name": "convolution2d_33", "class_name": "Convolution2D", "inbound_nodes": [[["elu_33", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_33", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_34", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_33", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_34", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_34", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_34", 0, 0]]], "config": {"trainable": true, "name": "elu_34", "alpha": 1.0}}, {"name": "convolution2d_34", "class_name": "Convolution2D", "inbound_nodes": [[["elu_34", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_34", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "bias": true, "activation": "linear"}}, {"name": "merge_15", "class_name": "Merge", "inbound_nodes": [[["merge_14", 0, 0], ["convolution2d_34", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_15", "concat_axis": -1}}, {"name": "batchnormalization_35", "class_name": "BatchNormalization", "inbound_nodes": [[["merge_15", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_35", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_35", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_35", 0, 0]]], "config": {"trainable": true, "name": "elu_35", "alpha": 1.0}}, {"name": "convolution2d_35", "class_name": "Convolution2D", "inbound_nodes": [[["elu_35", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_35", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "bias": true, "activation": "linear"}}, {"name": "batchnormalization_36", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_35", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_36", "epsilon": 1e-06, "axis": 1}}, {"name": "elu_36", "class_name": "ELU", "inbound_nodes": [[["batchnormalization_36", 0, 0]]], "config": {"trainable": true, "name": "elu_36", "alpha": 1.0}}, {"name": "convolution2d_36", "class_name": "Convolution2D", "inbound_nodes": [[["elu_36", 0, 0]]], "config": {"init": "he_normal", "nb_row": 3, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_36", "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "bias": true, "activation": "linear"}}, {"name": "merge_16", "class_name": "Merge", "inbound_nodes": [[["merge_15", 0, 0], ["convolution2d_36", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "mode": "sum", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_16", "concat_axis": -1}}, {"name": "averagepooling2d_1", "class_name": "AveragePooling2D", "inbound_nodes": [[["merge_16", 0, 0]]], "config": {"pool_size": [4, 4], "trainable": true, "dim_ordering": "th", "strides": [1, 1], "name": "averagepooling2d_1", "border_mode": "same"}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["averagepooling2d_1", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 256, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "linear"}}, {"name": "elu_37", "class_name": "ELU", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"trainable": true, "name": "elu_37", "alpha": 1.0}}, {"name": "batchnormalization_37", "class_name": "BatchNormalization", "inbound_nodes": [[["elu_37", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_37", "epsilon": 1e-06, "axis": -1}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["batchnormalization_37", 0, 0]]], "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 256, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "linear"}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "dense_3", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 256, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "linear"}}, {"name": "elu_38", "class_name": "ELU", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"trainable": true, "name": "elu_38", "alpha": 1.0}}, {"name": "elu_39", "class_name": "ELU", "inbound_nodes": [[["dense_3", 0, 0]]], "config": {"trainable": true, "name": "elu_39", "alpha": 1.0}}, {"name": "batchnormalization_38", "class_name": "BatchNormalization", "inbound_nodes": [[["elu_38", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_38", "epsilon": 1e-06, "axis": -1}}, {"name": "batchnormalization_39", "class_name": "BatchNormalization", "inbound_nodes": [[["elu_39", 0, 0]]], "config": {"momentum": 0.9, "trainable": true, "mode": 0, "name": "batchnormalization_39", "epsilon": 1e-06, "axis": -1}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["batchnormalization_38", 0, 0]]], "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["batchnormalization_39", 0, 0]]], "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"name": "bit_0", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_0", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_1", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_1", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_10", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_10", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_11", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_11", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_2", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_2", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_3", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_3", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_4", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_4", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_5", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_5", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_6", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_6", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_7", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_7", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_8", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_8", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "bit_9", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "bit_9", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "sigmoid"}}, {"name": "center_x", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "center_x", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "tanh"}}, {"name": "center_y", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "center_y", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "tanh"}}, {"name": "x_rot", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "x_rot", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "tanh"}}, {"name": "y_rot", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "y_rot", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "tanh"}}, {"name": "z_rot_cos", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "z_rot_cos", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "tanh"}}, {"name": "z_rot_sin", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "z_rot_sin", "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": null, "b_regularizer": null, "bias": true, "activation": "tanh"}}]}, "class_name": "Model"}