{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 64, 64], "name": "input_3"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "th", "trainable": true, "nb_filter": 32, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_13", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["input_3", 0, 0]]], "name": "convolution2d_13"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_17"}, "inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "leakyrelu_17"}, {"class_name": "BatchNormalization", "config": {"axis": 1, "trainable": true, "epsilon": 1e-06, "momentum": 0.9, "mode": 0, "name": "batchnormalization_17"}, "inbound_nodes": [[["leakyrelu_17", 0, 0]]], "name": "batchnormalization_17"}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "th", "trainable": true, "nb_filter": 32, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_14", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "name": "convolution2d_14"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_18"}, "inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "leakyrelu_18"}, {"class_name": "BatchNormalization", "config": {"axis": 1, "trainable": true, "epsilon": 1e-06, "momentum": 0.9, "mode": 0, "name": "batchnormalization_18"}, "inbound_nodes": [[["leakyrelu_18", 0, 0]]], "name": "batchnormalization_18"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_7", "pool_size": [2, 2]}, "inbound_nodes": [[["batchnormalization_18", 0, 0]]], "name": "maxpooling2d_7"}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "th", "trainable": true, "nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_15", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["maxpooling2d_7", 0, 0]]], "name": "convolution2d_15"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_19"}, "inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "leakyrelu_19"}, {"class_name": "BatchNormalization", "config": {"axis": 1, "trainable": true, "epsilon": 1e-06, "momentum": 0.9, "mode": 0, "name": "batchnormalization_19"}, "inbound_nodes": [[["leakyrelu_19", 0, 0]]], "name": "batchnormalization_19"}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "th", "trainable": true, "nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_16", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["batchnormalization_19", 0, 0]]], "name": "convolution2d_16"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_20"}, "inbound_nodes": [[["convolution2d_16", 0, 0]]], "name": "leakyrelu_20"}, {"class_name": "BatchNormalization", "config": {"axis": 1, "trainable": true, "epsilon": 1e-06, "momentum": 0.9, "mode": 0, "name": "batchnormalization_20"}, "inbound_nodes": [[["leakyrelu_20", 0, 0]]], "name": "batchnormalization_20"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_8", "pool_size": [2, 2]}, "inbound_nodes": [[["batchnormalization_20", 0, 0]]], "name": "maxpooling2d_8"}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "th", "trainable": true, "nb_filter": 128, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_17", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["maxpooling2d_8", 0, 0]]], "name": "convolution2d_17"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_21"}, "inbound_nodes": [[["convolution2d_17", 0, 0]]], "name": "leakyrelu_21"}, {"class_name": "BatchNormalization", "config": {"axis": 1, "trainable": true, "epsilon": 1e-06, "momentum": 0.9, "mode": 0, "name": "batchnormalization_21"}, "inbound_nodes": [[["leakyrelu_21", 0, 0]]], "name": "batchnormalization_21"}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "th", "trainable": true, "nb_filter": 128, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_18", "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "subsample": [1, 1]}, "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "name": "convolution2d_18"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_22"}, "inbound_nodes": [[["convolution2d_18", 0, 0]]], "name": "leakyrelu_22"}, {"class_name": "BatchNormalization", "config": {"axis": 1, "trainable": true, "epsilon": 1e-06, "momentum": 0.9, "mode": 0, "name": "batchnormalization_22"}, "inbound_nodes": [[["leakyrelu_22", 0, 0]]], "name": "batchnormalization_22"}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_9", "pool_size": [2, 2]}, "inbound_nodes": [[["batchnormalization_22", 0, 0]]], "name": "maxpooling2d_9"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["maxpooling2d_9", 0, 0]]], "name": "flatten_3"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1024, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_5", "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["flatten_3", 0, 0]]], "name": "dense_5"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_23"}, "inbound_nodes": [[["dense_5", 0, 0]]], "name": "leakyrelu_23"}, {"class_name": "BatchNormalization", "config": {"axis": 1, "trainable": true, "epsilon": 1e-06, "momentum": 0.9, "mode": 0, "name": "batchnormalization_23"}, "inbound_nodes": [[["leakyrelu_23", 0, 0]]], "name": "batchnormalization_23"}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}, "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "name": "dropout_5"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1024, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_6", "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_5", 0, 0]]], "name": "dense_6"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.3, "trainable": true, "name": "leakyrelu_24"}, "inbound_nodes": [[["dense_6", 0, 0]]], "name": "leakyrelu_24"}, {"class_name": "BatchNormalization", "config": {"axis": 1, "trainable": true, "epsilon": 1e-06, "momentum": 0.9, "mode": 0, "name": "batchnormalization_24"}, "inbound_nodes": [[["leakyrelu_24", 0, 0]]], "name": "batchnormalization_24"}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}, "inbound_nodes": [[["batchnormalization_24", 0, 0]]], "name": "dropout_6"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_0", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_0"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_1", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_1"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_10", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_10"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_11", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_11"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_2", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_2"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_3", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_3"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_4", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_4"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_5", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_5"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_6", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_6"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_7", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_7"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_8", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_8"}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "bit_9", "activation": "sigmoid", "W_regularizer": null, "init": "glorot_uniform", "input_dim": null}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "bit_9"}], "input_layers": [["input_3", 0, 0]], "name": "model_3", "output_layers": [["bit_0", 0, 0], ["bit_1", 0, 0], ["bit_2", 0, 0], ["bit_3", 0, 0], ["bit_4", 0, 0], ["bit_5", 0, 0], ["bit_6", 0, 0], ["bit_7", 0, 0], ["bit_8", 0, 0], ["bit_9", 0, 0], ["bit_10", 0, 0], ["bit_11", 0, 0]]}}